Benchmark Automation/Sysbench/results/pcc-test-01/sysbench_run.log

============================================
Azure VM Benchmark Script
============================================
Total estimated runtime: ~60 minutes
Results will be saved to: ./benchmark_results/pcc-test-01_benchmark_20260106_193016.txt

============================================
Checking Dependencies
============================================
sysbench version: sysbench 1.0.20
============================================
Collecting System Information
============================================
========================================
BENCHMARK RESULTS
========================================

Hostname: pcc-test-01
Date: Tue Jan  6 19:30:16 UTC 2026
Kernel: 6.8.0-1044-azure

--- CPU Information ---
Architecture:                         x86_64
CPU(s):                               1
Model name:                           Intel(R) Xeon(R) CPU E5-2673 v4 @ 2.30GHz
Thread(s) per core:                   1
Core(s) per socket:                   1
Socket(s):                            1
CPU max MHz:                          2300.0000

--- Memory Information ---
               total        used        free      shared  buff/cache   available
Mem:           848Mi       222Mi       189Mi       3.0Mi       437Mi       478Mi
Swap:             0B          0B          0B

--- Disk Information ---
Filesystem      Size  Used Avail Use% Mounted on
/dev/root        29G  2.0G   27G   7% /

--- Azure VM Size (if available) ---
Standard_B1s
============================================
Running CPU Benchmark (1200s)
============================================
>>> Using 1 threads

========================================
CPU BENCHMARK
========================================
Threads: 1
Duration: 1200s

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Prime numbers limit: 20000

Initializing worker threads...

Threads started!

CPU speed:
    events per second:   334.24

General statistics:
    total time:                          1200.0024s
    total number of events:              401084

Latency (ms):
         min:                                    2.11
         avg:                                    2.99
         max:                                   30.70
         95th percentile:                        3.55
         sum:                              1199566.10

Threads fairness:
    events (avg/stddev):           401084.0000/0.00
    execution time (avg/stddev):   1199.5661/0.00

============================================
Running Memory Benchmark (1200s)
============================================
>>> Using 1 threads

========================================
MEMORY BENCHMARK
========================================
Threads: 1
Duration: 1200s
Block size: 1K
Total size: 100G

--- Sequential Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (4226421.82 per second)

102400.00 MiB transferred (4127.37 MiB/sec)


General statistics:
    total time:                          24.8081s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   10.82
         95th percentile:                        0.00
         sum:                                10817.29

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   10.8173/0.00


--- Sequential Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: read
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (5283240.78 per second)

102400.00 MiB transferred (5159.41 MiB/sec)


General statistics:
    total time:                          19.8449s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    4.28
         95th percentile:                        0.00
         sum:                                 6197.21

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   6.1972/0.00


--- Random Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (1341999.19 per second)

102400.00 MiB transferred (1310.55 MiB/sec)


General statistics:
    total time:                          78.1332s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   13.16
         95th percentile:                        0.00
         sum:                                64241.83

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   64.2418/0.00


--- Random Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: read
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (1361006.15 per second)

102400.00 MiB transferred (1329.11 MiB/sec)


General statistics:
    total time:                          77.0418s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   14.23
         95th percentile:                        0.00
         sum:                                63446.06

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   63.4461/0.00

============================================
Running I/O Benchmark (1200s)
============================================
>>> Using 1 threads
>>> Creating test files (10G)...
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

128 files, 81920Kb each, 10240Mb total
Creating files for the test...
Extra file open flags: (none)
Creating file test_file.0
Creating file test_file.1
Creating file test_file.2
Creating file test_file.3
Creating file test_file.4
Creating file test_file.5
Creating file test_file.6
Creating file test_file.7
Creating file test_file.8
Creating file test_file.9
Creating file test_file.10
Creating file test_file.11
Creating file test_file.12
Creating file test_file.13
Creating file test_file.14
Creating file test_file.15
Creating file test_file.16
Creating file test_file.17
Creating file test_file.18
Creating file test_file.19
Creating file test_file.20
Creating file test_file.21
Creating file test_file.22
Creating file test_file.23
Creating file test_file.24
Creating file test_file.25
Creating file test_file.26
Creating file test_file.27
Creating file test_file.28
Creating file test_file.29
Creating file test_file.30
Creating file test_file.31
Creating file test_file.32
Creating file test_file.33
Creating file test_file.34
Creating file test_file.35
Creating file test_file.36
Creating file test_file.37
Creating file test_file.38
Creating file test_file.39
Creating file test_file.40
Creating file test_file.41
Creating file test_file.42
Creating file test_file.43
Creating file test_file.44
Creating file test_file.45
Creating file test_file.46
Creating file test_file.47
Creating file test_file.48
Creating file test_file.49
Creating file test_file.50
Creating file test_file.51
Creating file test_file.52
Creating file test_file.53
Creating file test_file.54
Creating file test_file.55
Creating file test_file.56
Creating file test_file.57
Creating file test_file.58
Creating file test_file.59
Creating file test_file.60
Creating file test_file.61
Creating file test_file.62
Creating file test_file.63
Creating file test_file.64
Creating file test_file.65
Creating file test_file.66
Creating file test_file.67
Creating file test_file.68
Creating file test_file.69
Creating file test_file.70
Creating file test_file.71
Creating file test_file.72
Creating file test_file.73
Creating file test_file.74
Creating file test_file.75
Creating file test_file.76
Creating file test_file.77
Creating file test_file.78
Creating file test_file.79
Creating file test_file.80
Creating file test_file.81
Creating file test_file.82
Creating file test_file.83
Creating file test_file.84
Creating file test_file.85
Creating file test_file.86
Creating file test_file.87
Creating file test_file.88
Creating file test_file.89
Creating file test_file.90
Creating file test_file.91
Creating file test_file.92
Creating file test_file.93
Creating file test_file.94
Creating file test_file.95
Creating file test_file.96
Creating file test_file.97
Creating file test_file.98
Creating file test_file.99
Creating file test_file.100
Creating file test_file.101
Creating file test_file.102
Creating file test_file.103
Creating file test_file.104
Creating file test_file.105
Creating file test_file.106
Creating file test_file.107
Creating file test_file.108
Creating file test_file.109
Creating file test_file.110
Creating file test_file.111
Creating file test_file.112
Creating file test_file.113
Creating file test_file.114
Creating file test_file.115
Creating file test_file.116
Creating file test_file.117
Creating file test_file.118
Creating file test_file.119
Creating file test_file.120
Creating file test_file.121
Creating file test_file.122
Creating file test_file.123
Creating file test_file.124
Creating file test_file.125
Creating file test_file.126
Creating file test_file.127
10737418240 bytes written in 191.69 seconds (53.42 MiB/sec).
tee: ./benchmark_results/pcc-test-01_benchmark_20260106_193016.txt: No such file or directory

========================================
I/O BENCHMARK
========================================
Threads: 1
Duration: 1200s
File size: 10G

--- Sequential Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      3421.82
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  53.47
    written, MiB/s:               0.00

General statistics:
    total time:                          300.0151s
    total number of events:              1026607

Latency (ms):
         min:                                    0.00
         avg:                                    0.29
         max:                                   75.07
         95th percentile:                        0.55
         sum:                               299434.11

Threads fairness:
    events (avg/stddev):           1026607.0000/0.00
    execution time (avg/stddev):   299.4341/0.00


--- Sequential Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1734.01
    fsyncs/s:                     2219.87

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               27.09

General statistics:
    total time:                          300.0545s
    total number of events:              1186258

Latency (ms):
         min:                                    0.01
         avg:                                    0.25
         max:                                  126.57
         95th percentile:                        0.81
         sum:                               298968.06

Threads fairness:
    events (avg/stddev):           1186258.0000/0.00
    execution time (avg/stddev):   298.9681/0.00


--- Random Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
FATAL: Size of file 'test_file.101' is 49.688MiB, but at least 80MiB is expected.
WARNING: Did you run 'prepare' with different --file-total-size or --file-num values?